{ "content" : [
    {
      "title" : "FIS",
      "link" : "https://www.fisglobal.com/",
      "year" : "Spring 2021 - Winter 2024",
      "imageSrc" : "Assets/portfolio-pictures/FIS.png",
      "iconImageSrc" : "Assets/icons/FIS-icon.jpg",
      "text" : "My most recent position was at a company called FIS, working in the eCommerce division. The microservice our team was assigned to was the Tokens Service, a tool for tokenizing cardholder information. Our clients included Starbucks, Deliveroo, Etsy, as well as may other eCommerce platforms. The main draw of our service was that if credit card information is stored in token it means that our clients don’t need to be as strict with Payment Card Industry standards, instead that burden fell on us. Our tech stack included Java, Spring,  AWS, and Gradle. My responsibilities, in adition to writing code, included testing our API using Karate, Deploying code using Teraform Scripts, and monitoring Splunk during on call shifts. In early Winter of 2024 my position was eliminated during a de-merger. I learned a majority of my software development skills at FIS and I am eternally grateful for my time there.",
      "skills": [
        {
            "skillName": "Java",
            "iconClass": "devicon-java-plain"
        },
        {
            "skillName": "Spring",
            "iconClass": "devicon-spring-original"
        },
        {
          "skillName": "Python",
          "iconClass": "devicon-python-plain"
        },
        {
          "skillName" : "Karate",
          "iconClass" : "devicon-karatelabs-plain"
        },
        {
          "skillName" : "AWS",
          "iconClass" : "devicon-amazonwebservices-plain-wordmark"
        },
        {
            "skillName": "Jenkins",
            "iconClass": "devicon-jenkins-line"
        }
        
      ]
    },
    {
        "title" : "DonorView",
        "year" : "Winter 2020 - Summer 2020",
        "link" : "https://www.donorview.com/",
        "imageSrc" : "Assets/portfolio-pictures/dv.png",
        "iconImageSrc" : "Assets/icons/dv-icon.jpg",
        "text" : "My first position out of college was at a company by the name of DonorView, working alongside a small team of three other developers. I used my ASP.NET, HTML, CSS, and SQL skills to create and maintain features for the all in one fundraising SaaS by the same name. The largest feature that I worked on during my time at DonorView was the Automatic Email Scheduler, a scheduler that queries constituent tables for constituents in need of an email. This position was a great opportunity for me to learn how to write industry quality code and use industry quality tools. As of April 2020 our teams started working from home and having our Agile meetings on Zoom. Unfortunately, my position was eliminated due to circumstances related to the pandemic in August 2020.",
        "skills": [{
          "skillName": "C#",
          "iconClass": "devicon-csharp-plain"
      },
      {
        "skillName": "ASP.net",
        "iconClass": "devicon-dotnetcore-plain"
      },
      {
        "skillName": "Azure",
        "iconClass": "devicon-azure-plain"
      },
      {
          "skillName": "SQL",
          "iconClass": "devicon-azuresqldatabase-plain"
      },
      {
          "skillName": "Tortoise SVN",
          "iconClass": "devicon-tortoisegit-plain"
      }
        ]
      },
      {
        "title" : "Yoda Command Line",
        "year" : "Spring 2019",
        "link" : "https://github.com/CraigRoss95/yoda",
        "imageSrc" : "Assets/portfolio-pictures/yoda.png",
        "iconImageSrc" : "Assets/icons/yoda-icon.png",
        "text" : "Yoda was the final project for my Computer Science capstone course: Senior Design & Development.The task given to us was to take an existing GitHub project and apply changes to fix existing issues, while also adding content as tasked by the Github issue tracker.We chose Yoda, “a wise and powerful virtual assistant”.My requested changes included the addition of a cooking module.In addition, I also had to fix an existing issues with the diary module where the user couldn't save entries to the json. We also had to write tests for our own functions as well as tests for existing functions lacking them. Together with my partners, we answered ten different requests before the end of the project.",
        "skills": [
          {
            "skillName": "Python",
            "iconClass": "devicon-python-plain"
        },
        {
            "skillName": "SQL",
            "iconClass": "devicon-azuresqldatabase-plain"
        }
        ]
        },
        {
        "title" : "Apocablocalypse",
        "year" : "Fall 2017",
        "link" : "https://natural-panic.itch.io/apocablocalypse/community",
        "imageSrc" : "Assets/portfolio-pictures/A.jpg",
        "iconImageSrc" : "Assets/icons/A-icon.png",
        "text" : "This was a game I worked on with some friends at Bridgewater State University. Apocablocalypse was my first time working on a project concurrently with other teammates using source control. The tools we used then are the same tools that I would use on later projects. These tools include: Git, Unity, and Trello. This was the first time in my career as a programmer that I really felt like I was collaborated with me peers. As a perk of being roommates with my team members I could give and receive feedback from across the room. This project was a very important turning point in my career; up until this point I had worked alone on all of my projects. When I worked in a group we were always pair programming. I was afraid that software engineering was going to be a very solitary job. What this project taught me is, that with proper source control, working together on software can greatly improve the quality of not only the code, but the experience of crafting software as a whole.",
        "skills": [
        {
            "skillName": "Unity",
            "iconClass": "devicon-unity-plain"
        },
        {
            "skillName": "C#",
            "iconClass": "devicon-csharp-plain"
        }
      ]
        },
        {
        "title" : "Bridgewater Adventure",
        "year" : "Spring 2017",
        "link" : "https://github.com/CraigRoss95/bridgewater-adventure",
        "imageSrc" : "Assets/portfolio-pictures/BA.png",
        "iconImageSrc" : "Assets/icons/BA-icon.png",
        "text" :"Bridgewater Adventure is a text-based adventure game made for my Data Structure & Algorithms class. This course was an early to mid level course in my college's Computer Science curriculum. The game was originally going to be eight rooms long, however after development started, the project quickly grew to a nearly forty room long game. The requirements for this project were to make a text based adventure game that utilized Object Oriented Programing. This project showed me the importance of building a good foundation for your project. A good foundation allows for conventions like inheritance and new features down the road. In the Summer of 2019, I went back and ported the game from Linux to Windows so I could get it running on my desktop and add it to my GitHub. ",
        "skills": [
        {
            "skillName": "C++",
            "iconClass": "devicon-unity-plain"
        },
        {
            "skillName": "CMAKE",
            "iconClass": "devicon-cmake-plain"
        },
        {
          "skillName" : "Linux",
          "iconClass" : "devicon-linux-plain"
        }
      ]
        },
        {
        "title" : "This Website",
        "year" : "2020 - Current",
        "link" : "https://github.com/CraigRoss95/Website",
        "imageSrc" : "Assets/portfolio-pictures/website.png",
        "iconImageSrc" : "Assets/icons/smoleMe.jpg",
        "text" :"My school's curriculum did not require Computer Science majors to take a web development course. Starting in the Summer of 2019, I began to self teach myself HTML and CSS by watching a YouTube tutorial and reading StackOverflow. While applying for jobs online, I also noticed that some companies listed an optional request for a website link. Having nearly five years of programing under my belt from college I picked up the basics with ease. After a two week HTML and CSS YouTube series I decided to start researching domains and build my website. In the future, I intend to learn more JavaScript to further enhance this website.",
        "skills": [
        {
            "skillName": "HTML",
            "iconClass": "devicon-html5-plain"
        },
        {
            "skillName": "CSS",
            "iconClass": "devicon-css3-plain"
        },
        {
          "skillName" : "JavaScript",
          "iconClass" : "devicon-javascript-plain"
        },
        {
          "skillName" : "AWS",
          "iconClass" : "devicon-amazonwebservices-plain-wordmark"
        },
        {
          "skillName" : "GitHub Pages",
          "iconClass" : "devicon-github-original"
        }
      ]
        },
        {
        "title" : "3rd Person Camera Demo",
        "year" : "Spring 2018",
        "link" : "https://github.com/CraigRoss95/3d-camera-demo",
        "imageSrc" : "Assets/portfolio-pictures/Unity3dDemo.png",
        "iconImageSrc" : "Assets/icons/Unity3dDemo-icon.png",
        "text" :"The Third Person Camera Demo was started as the precursor to Jonathan(see next entry). My highschool friends wanted to make a game together, so I joined them as the team's only programmer. When half of the team dropped out, the original adventure puzzle game was dropped. As a result so was the games third person camera. The camera controller was heavily inspired by the cameras in “A Hat in Time” and “Super Mario 64”. ",
        "skills": [
        {
            "skillName": "Unity",
            "iconClass": "devicon-unity-plain"
        },
        {
            "skillName": "C#",
            "iconClass": "devicon-csharp-plain"
        }
      ]
        },
        {
        "title" : "Jonathan",
        "year" : "Summer 2018",
        "link" : "https://github.com/CraigRoss95/Jonathan",
        "imageSrc" : "Assets/portfolio-pictures/Jonathan.png",
        "iconImageSrc" : "Assets/icons/Jonathan-icon.png",
        "text" : "Jonathan is a side scrolling shoot ‘em up game made with a friend during the summer of 2018. The game was inspired by the game “Sin and Punishment”. Jonathan sports a vaporwave aesthetic. I was the only programmer on this project. The only other team member that worked on Jonathan was the art person from the previous game. ",
        "skills": [
        {
            "skillName": "Unity",
            "iconClass": "devicon-unity-plain"
        },
        {
            "skillName": "C#",
            "iconClass": "devicon-csharp-plain"
        }
      ]
        },
        {
        "title" : "Untitled RPG",
        "year" : "Spring 2021",
        "link" : "https://github.com/CraigRoss95/RPG",
        "imageSrc" : "Assets/portfolio-pictures/RPG.png",
        "iconImageSrc" : "Assets/icons/RPG-icon.png",
        "text" :"I started this project in Spring of 2021, shortly after confirming the offer for a job at FIS that would start during Summer 2021. My contact at the company told me that my team would be using C# to work on our projects, so I decided a project in Unity would be a good way to refresh my knowledge of C#. The game was based off the Mario and Luigi action RPG series, the idea was that every character had a button assigned to them. Features included timed action commands for both dogging and attacking, player animations, and a menu system made from scratch. I was really proud with the way my player action economy system came out, every team member was assigned an action point that can be used once a turn. Action points can be used by multiple characters at once for more powerful effects. Unfortunately when my job at FIS did start up I learned that we were, in fact, using Java instead of C# and that my time would have been better spent making a Spring API. I feel like this project has the most polish out of all of my other personal projects and I hope to package it some day in a more consumable format, like a demo.",
        "skills": [
        {
            "skillName": "Unity",
            "iconClass": "devicon-unity-plain"
        },
        {
            "skillName": "C#",
            "iconClass": "devicon-csharp-plain"
        }
      ]
    }    
  ]
  
  }